USE TestDigDes

SET IDENTITY_INSERT Department ON
INSERT Department(ID,Name)VALUES
(1,N'Администрация'),
(2,N'Бухгалтерия'),
(3,N'ИТ')
SET IDENTITY_INSERT Department OFF


SET IDENTITY_INSERT Employee ON
INSERT Employee(ID,Department_ID, Chief_ID, Name, Salary)VALUES
(1,1,NULL,N'Иванов Иван Иванович','10000'),
(2,3,3,N'Петров Петр Петрович','9000'),
(3,2,1,N'Сидоров Сильвестор Сталоне','9000'),
(4,3,1,N'Андреев Роман Романович','3000'),
(5,1,2,N'Иванов Илья Ильич','10000'),
(6,2,4,N'Павлов Роман Романович','6000'),
(7,2,2,N'Ромашкин Андрей Андреевич','1000'),
(8,3,3,N'Медведев Андрей Андреевич','7000'),
(9,2,5,N'Невский Андрей Андреевич','2000'),
(10,1,7,N'Андропоф Андрей Андреевич','4000'),
(11,3,4,N'Мариенгоф Андрей Андреевич','2500'),
(12,1,5,N'Гете Петр Петрович','8000'),
(13,2,11,N'Пушкин Петр Петрович','8000'),
(14,2,12,N'Лермонтов Петр Петрович','1000'),
(15,3,6,N'Моисеев Иван Иванович','2000')

SET IDENTITY_INSERT Employee OFF